# Lesson 3  ==========================================
# Задание один: Напишите программу, которая проверяет, является ли введенная строка панграммой  ==========================================

rus=['а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']
eng=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'v', 'x', 'y', 'z']

for letter in str(input ('Введите фразу для анализа').lower()):
    if letter in rus:
        rus.remove(letter)
    if letter in eng:
        eng.remove(letter)


if len(rus) == 0 or len(eng) == 0:
    print('Фраза панграмма')
else:
    print('Фраза НЕ панграмма')
